tutorials/RAEplane/0/U
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  1.4.1                                 |
|   \\  /    A nd           | Web:      http://www.openfoam.org               |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/

FoamFile
{
    version 2.0;
    format ascii;

    root "";
    case "";
    instance "";
    local "";

    class volVectorField;
    object U;
}

// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //


dimensions      [0 1 -1 0 0 0 0];

internalField   uniform (299.35814 5.2253 0.0);

boundaryField
{
wingL
{
    type            slip;
}

wingR
{
    type            slip;
}

tail
{
    type            slip;
}

fuselage
{
    type            slip;
}

lateralL
{
    type            zeroGradient;
}

lateralR
{
    type            zeroGradient;
}

top
{
    type            zeroGradient;
}

outlet
{
    type            zeroGradient;
}

bottom
{
    type            fixedValue;
    value           uniform (299.35814 5.2253 0.0);
}

inlet
{
    type            fixedValue;
    value           uniform (299.35814 5.2253 0.0);
}
}


// ************************************************************************* //
